
## Plan Result




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;plum&#34;]
  * module.postgresql_flexible.azurerm_resource_group.rg[0]
  * module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs[&#34;plum&#34;]
  * module.postgresql_flexible.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "plum-v11-flexible-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "plum-v11-flexible-data-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
          + "application"         = "core"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "CNP"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "plum-v11-flexible-data-aat"
      + server_name         = "plum-v11-flexible-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "plum-v11-flexible-data-aat"
      + server_name         = "plum-v11-flexible-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["plum"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "plum"
      + server_id = (known after apply)
    }

  # module.postgresql_flexible.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "plum-v11-flexible-data-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
          + "application"         = "core"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "staging"
          + "managedBy"           = "CNP"
        }
    }

  # module.postgresql_flexible.null_resource.set-user-permissions-additionaldbs["plum"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "plum-v11-flexible"
          + "script_hash"    = "2a50bad49c6449b2d1527b84a4aaa1dfd52b647b991a52e2993ce1bd8d554cca"
        }
    }

  # module.postgresql_flexible.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":724,"Program":"tfcmt","SHA1":"","Vars":{}} -->